tap "anomalyco/tap"
tap "kdabir/tap"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Diff that understands syntax
brew "difftastic"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Text editor for your terminal: easy, powerful and fast
brew "fresh-editor"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Render markdown on the CLI
brew "glow"
# Reverse tethering tool for Android
brew "gnirehtet"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# High-performance, extensible alternative to ls
brew "lla"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Modern and intuitive terminal-based text editor
brew "micro"
# Open source relational database management system
brew "mysql-client"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk"
# Object-relational database system
brew "postgresql@16"
# Modern replacement for ps written in Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Graphical command-line client for SSH
brew "sshs"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr", link: false
# Official tldr client written in Rust
brew "tlrc"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Terminal UI OS (Terminal Multiplexer)
brew "tuios"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Android SDK component
cask "android-platform-tools"
# AI coding agent desktop client
cask "opencode-desktop"
# Visually compare folders and files
cask "visualdiffer"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/josharian/impl"
go "golang.org/x/pkgsite/cmd/pkgsite"
go "honnef.co/go/tools/cmd/staticcheck"
npm "@anthropic-ai/claude-code"
npm "corepack"
