brew "aichat"
brew "anomalyco/tap/opencode", trusted: true
brew "aria2"
brew "bat"
brew "btop"
brew "difftastic"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "fresh-editor"
brew "fx"
brew "fzf"
brew "git-filter-repo"
brew "glow"
brew "jq"
brew "lazygit"
brew "lnav"
brew "micro"
brew "nmap"
brew "procs"
brew "protobuf"
brew "ripgrep"
brew "stow"
brew "tlrc"
brew "typst"
brew "wget"
brew "yazi"
brew "zoxide"
cask "1password-cli"
cask "claude-code"
cask "easyfind"
cask "ghostty"
cask "onyx"
cask "opencode-desktop"
cask "pearcleaner"
cask "raycast"
cask "rectangle"
cask "the-unarchiver"
cask "transnomino"
cask "visualdiffer"
go "github.com/fatih/gomodifytags"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/haya14busa/goplay/cmd/goplay"
go "github.com/josharian/impl"
go "golang.org/x/pkgsite/cmd/pkgsite"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
npm "@google/gemini-cli"
npm "corepack"
tap "anomalyco/tap"
